vegeta-cli/src/vegeta/aeromant/templates/suction_hood/org/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

nu              {{KINEMATIC_VISCOSITY}};

// ************************************************************************* //
