vegeta-cli/src/vegeta/aeromant/templates/suction_hood/org/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{K_INLET}};

boundaryField
{
    ground
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }
    floor
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }
    suction
    {
        type            inletOutlet;
        inletValue      uniform {{K_INLET}};
        value           uniform {{K_INLET}};
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform {{K_INLET}};
        value           uniform {{K_INLET}};
    }
    "body.*"
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }
}

// ************************************************************************* //
